from query_to_db import *

#======================================== Создаем новую базу данных ============================================
# print(create_database(db_name='db_name 2'))
#==============================================================================================================

#======================================= Удаляем не нужную базу данных ========================================
# print(drop_database(db_name='db_name 2'))
#==============================================================================================================

#======================================= Создаем таблицу ====================================================
# columns = {
#         'id': 'SERIAL PRIMARY KEY',
#         'name': 'VARCHAR(255) NOT NULL',
#         'age': 'INTEGER',
#         'email': 'VARCHAR(255)'
#     }
#
# constraints = [
#     'UNIQUE (email)',
#     'CHECK (age >= 0)'
# ]
#
# table_name = 'users_3'
# database_name = 'db_name 1'
#
# print(create_table(table_name, columns, db_name=database_name))
#===============================================================================================================

#===================================== Добавляем данные в таблицу =============================================
# table = 'users'
# db_name = 'db_name 1'
# values = {
#     "id": 305,
#     "name": "Клава-кока",
#     "age": 25,
#     "email": "kva-kva@mail.ru"
# }
# print(insert_into_table(db_name=db_name, table_name=table, data=values))
#==============================================================================================================

#==================================== Вывод таблицы в консоль ================================================
# print(cat_all_table(db_name='db_name 1', table_name='users'))